app/views/comments/_comment.html.erb

<h2> コメント一覧 </h2>
  <% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 7]]