app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE (7) LIMIT ?  [["LIMIT", 1]]
---
  def index
    @articles = Article.all

SELECT "articles".* FROM "articles" WHERE (text LIKE '%kawaii%' or title LIKE '%kawaii%')
---
  def search
    if params[:search].blank?
      @articles = Article.all