app/controllers/articles_controller.rb

UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "watahijiko"], ["updated_at", "2019-02-16 00:14:39.692127"], ["id", 8]]
---
  def update
    @article = Article.find_by(params[:id])
    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 7]]
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy