app/controllers/comments_controller.rb

  def create
    @article = Article.find_by(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE (1) LIMIT ?  [["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "konbanwa"], ["body", "konnichiwa"], ["article_id", 1], ["created_at", "2019-03-25 15:52:00.712724"], ["updated_at", "2019-03-25 15:52:00.712724"]]

  def destroy
    @article = Article.find_by(params[:article_id])
    @comment = @article.comments.find_by(params[:id])
    @comment.destroy
---
SELECT  "articles".* FROM "articles" WHERE (8) LIMIT ?  [["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND (4) LIMIT ?  [["article_id", 8], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]