app/controllers/sessions_controller.rb

  def create
    user = User.find_by_userid(params[:userid])
---
SELECT  "users".* FROM "users" WHERE "users"."userid" = ? LIMIT ?  [["userid", "gonnbe1106"], ["LIMIT", 1]]