app/controllers/subscribers_controller.rb

SELECT "subscribers".* FROM "subscribers"
---
  def index
    @subscribers = Subscriber.all

SELECT  1 AS one FROM "subscribers" WHERE "subscribers"."email" = ? LIMIT ?  [["email", "morenoarmando@yahoo.es"], ["LIMIT", 1]]
INSERT INTO "subscribers" ("f_name", "l_name", "email", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @subscriber = Subscriber.new(subscriber_params)
    if Subscriber.exists?(email: @subscriber.email)
      redirect_to root_path, alert:
      "こちらのメールアドレスは既に登録されています"
    elsif
      @subscriber.save

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "subscribers" WHERE "subscribers"."id" = ?  [["id", 1]]
---
def destroy
  @subscriber = Subscriber.find(params[:id])
  @subscriber.destroy